#include <iostream>

int main()
{
    setlocale(LC_ALL,"ru");
    float a,b,c,d,e,f,g,h,i,j,k,l;
    long double m,n,o,p,q,r,s,t,u,v,w,x;
    a = 1000.f;
    b = 0.0001f;
    
    c = a+b; // СЛОЖЕНИЕ ПЕРЕМЕННЫХ В ЧИСЛИТЕЛЕ
    d = c*c*c; // ПЕРВАЯ СКОБКА, ВОЗВЕДЕНИЕ В КУБ

    e = a*a*a; // ВОЗВЕДЕНИЕ ВО ВТОРОЙ СКОБКЕ "a" В КУБ
    f = 3*a*a*b; // ВТОРОЕ СЛАГАЕМОЕ ВО ВТОРОЙ СКОБКЕ
    g = e + f; // ВТОРАЯ СКОБКА

    h = d - e; // ЧИСЛИТЕЛЬ

    i = 3*a*b*b; // СЛАГАЕМОЕ В ЗНАМЕНАТЕЛЕ
    j = b*b*b; // ВТОРОЕ СЛАГАЕМОЕ В ЗНАМЕНАТЕЛЕ

    k = i+j; // ЗНАМЕНАТЕЛЬ

    l = h/k; // ЗНАЧЕНИЕ ВЫРАЖЕНИЯ

    // DOUBLE

    m = 1000.f;
    n = 0.0001f;
    
    o = m+n; // СЛОЖЕНИЕ ПЕРЕМЕННЫХ В ЧИСЛИТЕЛЕ
    p = o*o*o; // ПЕРВАЯ СКОБКА, ВОЗВЕДЕНИЕ В КУБ

    q = m*m*m; // ВОЗВЕДЕНИЕ ВО ВТОРОЙ СКОБКЕ "a" В КУБ
    r = 3*m*m*n; // ВТОРОЕ СЛАГАЕМОЕ ВО ВТОРОЙ СКОБКЕ
    s = q + r; // ВТОРАЯ СКОБКА

    t = p - s; // ЧИСЛИТЕЛЬ

    u = 3*m*n*n; // СЛАГАЕМОЕ В ЗНАМЕНАТЕЛЕ
    v = n*n*n; // ВТОРОЕ СЛАГАЕМОЕ В ЗНАМЕНАТЕЛЕ

    w = u+v; // ЗНАМЕНАТЕЛЬ

    x = t/w; // ЗНАЧЕНИЕ ВЫРАЖЕНИЯ

    std::cout << std::fixed << h << " Числитель в float\n";
    std::cout << std::fixed << k << " Знаменатель в float\n";
    std::cout << std::fixed << l << " Значение выраженния в float\n\n"; 

    std::cout << std::fixed << t << " Числитель в double\n";
    std::cout << std::fixed << w << " Знаменатель в double\n";
    std::cout << std::fixed << x << " Значение выраженния в double\n\n"; 

    return 0;
}