#include <iostream>
#include <cmath>

int main()
{
    float a,b,c,d,e,f,g,h,i,j,k,l;
    a = 1000.f;
    b = 0.0001f;
    
    c = a+b; // СЛОЖЕНИЕ ПЕРЕМЕННЫХ В ЧИСЛИТЕЛЕ
    d = c*c*c; // ПЕРВАЯ СКОБКА, ВОЗВЕДЕНИЕ В КУБ

    e = a*a*a; // ВОЗВЕДЕНИЕ ВО ВТОРОЙ СКОБКЕ "a" В КУБ
    f = 3*a*b; // ВТОРОЕ СЛАГАЕМОЕ ВО ВТОРОЙ СКОБКЕ
    g = e + f; // ВТОРАЯ СКОБКА

    h = d - e; // ЧИСЛИТЕЛЬ

    i = 3*a*b*b; // СЛАГАЕМОЕ В ЗНАМЕНАТЕЛЕ
    j = b*b*b; // ВТОРОЕ СЛАГАЕМОЕ В ЗНАМЕНАТЕЛЕ

    k = i+j; // ЗНАМЕНАТЕЛЬ

    l = h/k; // ЗНАЧЕНИЕ ВЫРАЖЕНИЯ

    std::cout << std::fixed << l;

    /*
    

    
    */

    return 0;
}